papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/HronTurekFsi3/base/partitioned/0/fluid/D.monolithic
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      D;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    plate
    {
        type            fixedDisplacement;

        // Do not update pointD from D, as the pointD interface field has
        // already been set from the solid side
        enforcePointPatchField no;
        value           uniform (0 0 0);
    }

    inlet
    {
        type            fixedDisplacement;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            fixedDisplacement;
        value           uniform (0 0 0);
    }

    cylinder
    {
        type            fixedDisplacement;
        value           uniform (0 0 0);
    }

    bottom
    {
        type            fixedDisplacement;
        value           uniform (0 0 0);
    }

    top
    {
        type            fixedDisplacement;
        value           uniform (0 0 0);
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}

// ************************************************************************* //
