papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/HronTurekFsi3/base/partitioned/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface NewtonQuasiMonolithic;

NewtonQuasiMonolithicCoeffs
{
    // Solid and fluid interface patches
    solidPatch plate;
    fluidPatch plate;

    // Enable coupling
    coupled         no;

    // Activate FSI coupling at this time so that the inlet flow develops first
    couplingStartTime 2.0;

    // Mapping data across the solid-fluid interface
    interfaceTransferMethod directMap;

    // PETSc SNES options for the monolithic UpU system are defined in
    // system/fvSolution. Alternatively, an optionsFile can be specified here.
    //optionsFile     petscOptions.mf_fieldsplit;
    //optionsFile     petscOptions.lu;

    // Pass viscous forces from fluid-to-solid interface (in addition to pressure
    // forces)
    passViscousStress yes;

    // Scaling for fluid system to improve the condition number
    fluidSystemScaleFactor 1e+08;
}

// ************************************************************************* //
