papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/HronTurekFsi3/base/partitioned/system/fvSolution.monolithic.physicsPC
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    UpU
    {
        solver    petsc;

        options
        {
            snes_type newtonls;
            snes_linesearch_type basic;
            snes_rtol "1e-6";
            snes_stol "1e-6";
            snes_monitor;
            snes_converged_reason;
            snes_max_linear_solve_fail "100";

            snes_mf_operator;

            // fgmres is required because the physics PC is variable
            ksp_type fgmres;
            ksp_gmres_restart "200";
            ksp_rtol "1e-4";
            ksp_pc_side right;
            ksp_converged_reason;
            ksp_max_it "1000";

            pc_type physics;
            pc_physics_type model;
        }
    }

    // One fixed momentum correction per physics PC application
    dU
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       0;
        relTol          0;
        minIter         1;
        maxIter         1;
    }

    // One fixed pressure correction per physics PC application
    dp
    {
        solver          GAMG;
        tolerance       0;
        relTol          0;
        minIter         1;
        maxIter         1;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     1;
        nFinestSweeps   1;
        scaleCorrection true;
        directSolveCoarsest false;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }
}

// ************************************************************************* //
